# Step 3 Import your analysis libraries, as well as your new customer data set as a dataframe.

In [3]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [5]:
path = r"C:\Users\toloz\Instacart Basket Analysis 9_11_2024"

In [7]:
# read the file to import the data
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'customers.csv'))

In [8]:
# preview the data
df_customers.head(5)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
# check the shape of it 
df_customers.shape

(206209, 10)

In [10]:
#describe the data
df_customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [11]:
df_customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# Step 4 Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [13]:
df_customers.head(5)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [14]:
# lets tart to change First Name to first_name since most columns are LOWER case  
# also Surname and Gender to gender and also state and age

In [15]:
df_customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [16]:
df_customers.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [17]:
df_customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [18]:
df_customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [19]:
df_customers.rename(columns = {'fam_status' : 'martial_status'}, inplace = True)

In [20]:
df_customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [21]:
df_customers.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,martial_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [22]:
# I will keep all columns since we can use them all for analysis

# Step 5 Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [24]:
# cheking for mixed-type data 
df_customers.dtypes

user_id            int64
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
martial_status    object
income             int64
dtype: object

In [25]:
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

first_name

In [26]:
# looks like the first name has mixed-types lets fix it!

In [27]:
df_customers['first_name'] = df_customers['first_name'].astype('str')

In [28]:
# we also need to change the user_id to str
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [29]:
df_customers.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
martial_status    object
income             int64
dtype: object

In [30]:
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

In [31]:
#now lets check for missing data 
df_customers.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
martial_status    0
income            0
dtype: int64

 No missin data

In [33]:
df_customers_dup = df_customers[df_customers.duplicated()]

In [34]:
df_customers_dup

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, martial_status, income]
Index: []

No duplicates in the data frame!

# Step 6 Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [37]:
# import the last dataframe we did
ords_prods  = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared data', 'aggr_ords_prods_merge_deri.pkl'))

In [38]:
#check the shape for both

In [39]:
ords_prods.shape

(32404859, 25)

In [40]:
df_customers.shape

(206209, 10)

In [41]:
# lets check for common columns!

In [42]:
ords_prods.head(5)

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,price_range_loc,busiest day,busiest days,busiest_period_of_day,max_order,loyalty_flag,average_spend,spender_flag,Customer_frequency,frequency_flag
0,2539329,1,1,2,8,7.0,196,1,0,both,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.0,Regular customer
1,2398795,1,2,3,7,15.0,196,1,1,both,...,Mid-range product,Regularly busy,two slowest days,Average orders,10,New customer,6.367797,Low_spender,20.0,Regular customer
2,473747,1,3,3,12,21.0,196,1,1,both,...,Mid-range product,Regularly busy,two slowest days,Most orders,10,New customer,6.367797,Low_spender,20.0,Regular customer
3,2254736,1,4,4,7,29.0,196,1,1,both,...,Mid-range product,Least busy,two slowest days,Average orders,10,New customer,6.367797,Low_spender,20.0,Regular customer
4,431534,1,5,4,15,28.0,196,1,1,both,...,Mid-range product,Least busy,two slowest days,Most orders,10,New customer,6.367797,Low_spender,20.0,Regular customer

In [43]:
df_customers.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,martial_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [44]:
# Both tables have user_id
# as we seen on top this is int we need to change to str before joining the tables
ords_prods.dtypes['user_id']

dtype('int64')

In [45]:
ords_prods['user_id'] = ords_prods['user_id'].astype('str')

In [46]:
customers_ords_prods = ords_prods.merge(df_customers, on = 'user_id', indicator = "Merge_")

In [47]:
customers_ords_prods.shape

(32404859, 35)

In [84]:
customers_ords_prods.head(5)

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,first_name,surname,gender,state,age,date_joined,n_dependants,martial_status,income,Merge_
0,2539329,1,1,2,8,7.0,196,1,0,both,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,1,1,both,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,196,1,1,both,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,1,1,both,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,196,1,1,both,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [88]:
#check common values 
customers_ords_prods['Merge_'].value_counts()

Merge_
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [92]:
# as always check for the dtypes
customers_ords_prods.dtypes

order_id                     int64
user_id                     object
order_number                 int64
order_dow                    int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
_merge                    category
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
merge_indicator           category
price_range_loc             object
busiest day                 object
busiest days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spend              float64
spender_flag                object
Customer_frequency         float64
frequency_flag              object
first_name                  object
surname                     object
gender                      object
state                       object
age                          int64
date_joined                 object
n_dependants                 int64
martial_status              object
income                       int64
Merge_                    category
dtype: object

In [94]:
#order id is int lets change it to object 
customers_ords_prods['order_id'] = customers_ords_prods['order_id'].astype('str')

In [96]:
#Import this file as pickle to continue to part 2
customers_ords_prods.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_customers_merged.pkl'))

In [ ]:
# I have already done Step